{
  "users": [
    {
      "id": 1,
      "name": "Thienluc",
      "password": "$2b$10$.sOIBP8zNGal35Pn5HD.k.QAYrwVZFpi55RsWyN7cNsKzLUQ7yaRm",
      "email": "thienluc@gmail.com",
      "refreshToken": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MSwibmFtZSI6IlRoaWVubHVjIiwiaWF0IjoxNjgzMTkwNDQ5LCJleHAiOjE2ODMzNjMyNDl9.CtHahqrPqg2a7zBerhEusLpZQebQ-oQ6xGwWmDzxpGM",
      "role": 1,
      "status": 1,
      "avatar": { "url": "https://i.ibb.co/D4GN1gj/unsplah1.png" },
      "telephone": "0973356638",
      "birth": "2000-07-06"
    },
    {
      "id": 2,
      "name": "Doankhanh",
      "password": "$2b$10$kxmCQf/cmLeaDi/cfFOF2.aAWGfYhe.ImZHccZD5b4YQyVQxsbzvy",
      "email": "doankhanh@gmail.com",
      "telephone": "0123456789",
      "status": 1,
      "role": 3,
      "avatar": { "url": "https://i.ibb.co/rksR2gq/khoi-cau-xanh.jpg" },
      "refreshToken": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MiwibmFtZSI6IkRvYW5raGFuaCIsImlhdCI6MTY4MTExNTkxMywiZXhwIjoxNjgxMjg4NzEzfQ.0wkQSlpjYxiD0_l3KSHbW3AZLYozMdL1UfJ93yWk0bk",
      "birth": ""
    }
  ],
  "categories": [
    {
      "id": "f6de1fd2-9e13-45a8-b600-56dd1816fe94",
      "name": "Tin tức",
      "slug": "tin-tuc",
      "status": 1
    },
    {
      "id": "2065f0d4-f7f8-4019-9534-ddc9eb1dcf40",
      "name": "Lập trình",
      "slug": "lap-trinh",
      "status": 1
    },
    {
      "id": "b6a4cd0b-c260-4a4d-8015-26926531f3a5",
      "name": "Bóng đá",
      "slug": "bong-dja",
      "status": 1
    }
  ],
  "blogs": [
    [
      {
        "id": "7d83f088-d2ad-434b-8ee5-590c1679b116",
        "title": "Miễn đăng kiểm xe mới, kéo dài chu kỳ với xe cũ",
        "slug": "mien-djang-kiem-xe-moi-keo-dai-chu-ky-voi-xe-cu",
        "image": {
          "url": "https://i.ibb.co/fS85DZs/didong.webp"
        },
        "content": "<p>Từ ngày 22/3, các loại xe mới được miễn đăng kiểm lần đầu; xe gia đình, xe cá nhân dưới 7 năm được kéo dài chu kỳ kiểm định đến 24 tháng.</p><p>Theo Thông tư số 2/2023 ban hành tối 21/3, Bộ Giao thông Vận tải quy định xe chưa qua sử dụng được miễn kiểm định lần đầu, tính từ năm sản xuất đến năm nộp hồ sơ đề nghị cấp Giấy chứng nhận kiểm định dưới 2 năm. Chủ xe được cấp tem và giấy chứng nhận tại các trung tâm đăng kiểm mà không phải mang xe đến trình diện.</p><p>Bộ Giao thông Vận tải cũng kéo dài chu kỳ kiểm định đầu tiên với ôtô chở người đến 9 chỗ không kinh doanh vận tải từ 30 tháng như trước đây lên 36 tháng. Với xe sản xuất đến 7 năm, chu kỳ kiểm định định kỳ được kéo dài từ 18 lên 24 tháng. Xe sản xuất trên 7 năm đến 20 năm (trước là 12 năm) chu kỳ giữ nguyên 12 tháng; xe trên 20 năm thì giữ 6 tháng.</p><p><img src=\"https://i1-vnexpress.vnecdn.net/2023/03/22/L1003444-JPG-4174-1679444363.jpg?w=680&amp;h=0&amp;q=100&amp;dpr=1&amp;fit=crop&amp;s=ejJFw2h47YgtNj4mkaDEHA\" alt=\"Hà Nội sát hạch đăng kiểm viên ngày 12/3. Ảnh: Ngọc Thành\"></p><p>Hà Nội sát hạch đăng kiểm viên ngày 12/3. Ảnh:<em>&nbsp;Ngọc Thành</em></p><p>Với xe chở người các loại trên 9 chỗ có kinh doanh vận tải, chu kỳ đầu tiên tăng từ 18 lên 24 tháng. Xe sản xuất đến 5 năm thì chu kỳ định kỳ tăng từ 6 lên 12 tháng. Xe trên 5 năm giữ nguyên quy định 6 tháng kiểm định một lần.</p><p>Nhóm ôtô tải các loại, ôtô đầu kéo từ 20 năm trở lên (kể cả ôtô tải, ôtô đầu kéo đã cải tạo thành ôtô chuyên dùng), ôtô tải được cải tạo chuyển đổi công năng từ ôtô chở người có thời gian sản xuất từ 15 năm trở lên được kéo dài chu kỳ kiểm định từ 3 lên 6 tháng.</p><p>Thông tư cũng điều chỉnh một số điều nhằm giảm thủ tục, chi phí và thời gian cho người dân và doanh nghiệp khi đi đăng kiểm.</p><p>Theo Bộ Giao thông Vận tải, thời gian qua Thông tư 16/2021 về kiểm định an toàn kỹ thuật và bảo vệ môi trường phương tiện cơ giới đường bộ đã bộc lộ bất cập như yêu cầu kiểm định đối với xe mới, chu kỳ kiểm định chưa phù hợp với điều kiện thực tế, đặc biệt đối với xe cá nhân (không kinh doanh vận tải). Bộ đã rà soát, nghiên cứu, đề xuất Chính phủ và được chấp thuận cho phép sửa đổi Thông tư 16 theo trình tự rút gọn.</p><p>Ngoài sửa Thông tư 16, Bộ cũng đang chủ trì sửa Nghị định 139/2018 về kinh doanh dịch vụ kiểm định xe cơ giới, trong đó tách bạch công tác quản lý nhà nước và cung cấp dịch vụ công trong đăng kiểm; đẩy mạnh phân cấp, phân quyền cho địa phương và tăng cường thanh tra, kiểm tra, phòng ngừa tiêu cực.</p><p>Bộ cũng sẽ ưu tiên nghiên cứu cho phép các trung đăng kiểm của công an, quân đội và các cơ sở bảo hành, bảo dưỡng chính hãng của nhà sản xuất, lắp ráp, nhập khẩu ôtô đáp ứng quy định về cơ sở bảo hành, bảo dưỡng được phép cung cấp dịch vụ kiểm định ôtô.</p><p>Việc sửa đổi hai văn bản trên được xem là giải pháp căn cơ giải quyết&nbsp;<a href=\"https://vnexpress.net/khung-hoang-dang-kiem-4579502.html\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(7, 109, 182);\">khủng hoảng đăng kiểm</a>, khi hơn 70 trung tâm đăng kiểm phải đóng cửa, gần 500 người bị khởi tố, điều tra về các tội&nbsp;<em>Nhận hối lộ, Môi giới hối lộ, Giả mạo trong công tác&nbsp;</em>và&nbsp;<em>Sản xuất, mua bán công cụ, phần mềm để sử dụng vào mục đích trái pháp luật.</em></p><p><br></p>",
        "category": {
          "name": "Tin tức",
          "slug": "tin-tuc"
        },
        "hot": true,
        "status": 1,
        "author": {
          "id": 1,
          "name": "Thienluc",
          "avatar": "https://i.ibb.co/D4GN1gj/unsplah1.png"
        },
        "description": "Việc sửa đổi hai văn bản trên được xem là giải pháp căn cơ giải quyết khủng hoảng đăng kiểm, khi hơn 70 trung tâm đăng kiểm phải đóng cửa, gần 500 người bị khởi tố, điều tra về các tội Nhận hối lộ, Môi giới hối lộ, Giả mạo trong công tác và Sản xuất, mua bán công cụ, phần mềm để sử dụng vào mục đích trái pháp luật.",
        "createdAt": "22/3/2023"
      },
      {
        "id": "b943e6b9-72e3-4dfe-b50e-3fb7ee100414",
        "title": "Bồ Đào Nha sáng cửa nhất ở vòng loại Euro 2024",
        "slug": "bo-djao-nha-sang-cua-nhat-o-vong-loai-euro-2024",
        "image": {
          "url": "https://i.ibb.co/r0vXkjC/thietket-website.jpg"
        },
        "content": "<p>Nghiên cứu của công ty dữ liệu Gracenote chỉ ra khả năng đi tiếp của Cristiano Ronaldo và đồng đội là cao nhất trong số các đội tuyển dự vòng loại Euro 2024.</p><p>Theo đó, Bồ Đào Nha được đánh giá có 96% khả năng vượt qua vòng loại. Họ là một trong bốn đội có cơ hội trên 90%, bên cạnh Thụy Sĩ , Croatia và Tây Ban Nha.</p><p><a href=\"https://vnexpress.net/chu-de/doi-tuyen-bong-da-bo-dao-nha-537\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(7, 109, 182);\">Bồ Đào Nha</a>&nbsp;nằm ở bảng J, cùng các đội Bosnia &amp; Herzegovina, Iceland, Luxembourg, Slovakia và Liechtenstein. Đây được xem là bảng đấu nhẹ ký với nhà vô địch năm 2016. Họ sẽ tiếp Liechtenstein trong trận ra quân ngày 23/3 - trận ra mắt của tân HLV Roberto Martinez, rồi làm khách trên sân Luxembourg ba ngày sau đó.</p><p><img src=\"https://i1-thethao.vnecdn.net/2023/03/21/Untitled-4273-1679408756.jpg?w=680&amp;h=0&amp;q=100&amp;dpr=1&amp;fit=crop&amp;s=Bu0dZJpJc_Z8V1nAH-82RQ\" alt=\"Ronaldo và đồng đội được đánh giá sáng cửa qua vòng loại Euro 2024 nhất. Ảnh: Reuters\"></p><p>Ronaldo và đồng đội được đánh giá sáng cửa qua vòng loại Euro 2024 nhất. Ảnh:&nbsp;<em>Reuters</em></p><p>Gracenote là công ty thu thập và phân tích dữ liệu thuộc tập toàn Nielsen Holdings. Ngoài Bồ Đào Nha, nghiên cứu về vòng loại Euro 2024 của họ còn chỉ ra các đội đứng top 2 của 10 bảng và giành vé chơi vòng chung kết gồm Bỉ, Đan Mạch, Hà Lan, Ba Lan, Serbia, Pháp, CH Czech, Italy, Anh, Hungary, Thụy Điển, Xứ Wales, Slovenia, Na Uy, Romania và Bosnia.</p><p>Nếu dự đoán này chính xác, Na Uy sẽ lần đầu tham dự Euro kể từ năm 2000 nhờ đầu tàu là tiền đạo đang chơi cho Man City Erling Haaland và tiền vệ thủ quân thuộc biên chế Arsenal Martin Odegaard.</p><p>Đương kim vô địch Italy và đương kim á quân Anh lần lượt có khả năng đi tiếp là (78%) và (77%) khi cùng bảng C với Ukraine, Malta và Bắc Macedonia. Italy và Anh sẽ đối đầu nhau trên sân Diego Armando Maradona tối 23/3.</p><p>20 suất vào thẳng vòng chung kết Euro 2024 sẽ thuộc về hai đội đứng đầu mỗi bảng. Ba suất còn lại được xác định thông qua play-off. Các đội đứng đầu bảng ở Nations League nhóm A, B và C, gồm Hà Lan, Croatia, Tây Ban Nha, Italy, Israel, Bosnia, Serbia, Scotland, Georgia, Hy Lạp, Thổ Nhĩ Kỳ và Kazakhstan, sẽ có suất đá play-off nếu không giành vé trực tiếp bằng cách lọt top hai bảng đấu của họ.</p><p>Euro 2024 dự kiến diễn ra từ ngày 14/6/2024 đến 14/7/2024 với sự tham gia của 23 đội vượt qua vòng loại và chủ nhà Đức.</p>",
        "category": {
          "name": "Bóng đá",
          "slug": "bong-da"
        },
        "hot": false,
        "status": 1,
        "author": {
          "id": 1,
          "name": "Thienluc",
          "avatar": "https://i.ibb.co/D4GN1gj/unsplah1.png"
        },
        "description": "20 suất vào thẳng vòng chung kết Euro 2024 sẽ thuộc về hai đội đứng đầu mỗi bảng. Ba suất còn lại được xác định thông qua play-off. Các đội đứng đầu bảng ở Nations League nhóm A, B và C, gồm Hà Lan, Croatia, Tây Ban Nha, Italy, Israel, Bosnia, Serbia, Scotland, Georgia, Hy Lạp, Thổ Nhĩ Kỳ và Kazakhstan, sẽ có suất đá play-off nếu không giành vé trực tiếp bằng cách lọt top hai bảng đấu của họ",
        "createdAt": "22/3/2023"
      },
      {
        "id": "79f410c2-233f-4231-bcf0-9d80fa3f347a",
        "title": "Nhiều lập trình viên bắt đầu sợ AI",
        "slug": "nhieu-lap-trinh-vien-bat-djau-so-ai",
        "image": {
          "url": "https://i.ibb.co/6rTX7gx/chatgpt-update-5266-1674724795-3649-1682782382.jpg"
        },
        "content": "<p>Hàng loạt kỹ sư lập trình và những người làm trong ngành công nghệ đang lo ngại nguy cơ bị AI giành việc.</p><p>Trên mạng ẩn danh Blind, các lập trình viên đang đặt câu hỏi liệu AI có khiến công việc của họ trở nên vô nghĩa không, nhất là sau khi&nbsp;<a href=\"https://vnexpress.net/chu-de/chatgpt-5974\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(7, 109, 182);\">ChatGPT</a>&nbsp;tạo nên cơn sốt. Hàng chục bài viết về vấn đề này được đăng lên, trong khi nhiều người cho rằng \"giai đoạn vàng của lập trình viên đã kết thúc\".</p><p>\"Công việc kỹ sư phần mềm đang chết dần. ChatGPT rất giỏi, và các bạn đang ở trong thế khó khăn\", một lập trình viên của Microsoft viết. Bài viết thu hút 500 phản hồi, trong đó một số cho rằng ngành lập trình vẫn vững vàng, nhưng không ít người nói \"mọi công việc của giới cổ cồn trắng đang chết dần\".</p><p>Một người lập khảo sát trên Blind, hỏi có phải kỹ sư phần mềm trẻ tuổi sắp mất việc hay không, và thu được hơn 12.000 lượt bình chọn. 41,3% đồng tình, 37% cho rằng cơ hội việc làm không thay đổi, trong khi 21,7% khẳng định giờ đây có nhiều tiềm năng công việc hơn.</p><p>Blind là nền tảng cho phép người tham gia bình luận ẩn danh về công việc và công ty họ đang làm. Người đăng ký tài khoản phải cung cấp địa chỉ email công việc, chức danh, vị trí... để nền tảng có thể đánh giá trạng thái nghề nghiệp trước khi được chấp nhận hoạt động. Mạng xã hội này cũng thường xuyên gửi yêu cầu xác thực qua email sau một thời gian nhất định nhằm xác định một người còn làm tại công ty đó hay không.</p><p><img src=\"https://i1-sohoa.vnecdn.net/2023/04/29/chatgpt-update-5266-1674724795-3649-1682782382.jpg?w=680&amp;h=0&amp;q=100&amp;dpr=1&amp;fit=crop&amp;s=gd0DPCQqa2XnR0xGaAO7nw\" alt=\"ChatGPT được sử dụng ngày một nhiều trong môi trường công sở. Minh họa: Searchengine Journal\"></p><p>Hình ảnh ChatGPT trên laptop. Ảnh:<em>&nbsp;Searchengine Journal</em></p><p>Không ít người nói đang lo lắng về tương lai trước sự phổ biến của AI. Một kỹ sư Google nói đang tự hỏi có nên làm lại sự nghiệp từ đầu hay không. Một nhân viên Amazon nhận định lĩnh vực họ đã trau dồi kiến thức suốt 15 năm qua đang thay đổi.</p><p>\"Tôi thử nghịch&nbsp;<a href=\"https://vnexpress.net/so-hoa/sieu-ai-gpt-4-ra-mat-4581416.html\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(7, 109, 182);\">GPT-4</a>, kết quả khiến tôi sợ hãi và đau buồn\", người này nói.</p><p>Sự lo lắng xuất hiện trong bối cảnh các tập đoàn công nghệ đặt cược vào tương lai AI. Công ty OpenAI từ đầu năm đã bắt đầu huấn luyện AI học và lập trình phần mềm. Truyền thông Mỹ đưa tin các tiến bộ của AI như ChatGPT đang bắt đầu đe dọa an toàn việc làm của các kỹ sư phần mềm. Emad Mostaque, CEO của Stability AI, thậm chí dự đoán sẽ không còn lập trình viên trong 5 năm tới.</p><p>Giới công nghệ cũng đang trải qua đợt sa thải quy mô lớn, khiến các kỹ sư tính đến khả năng không duy trì được mức lương cao hiện tại. Quan niệm rằng học lập trình luôn được đảm bảo công việc cũng đang bị xóa bỏ.</p><p>Dù vậy, vẫn có những người lạc quan&nbsp;<a href=\"https://vnexpress.net/chu-de/tri-tue-nhan-tao-ai-1980\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(7, 109, 182);\">AI</a>&nbsp;sẽ đem lại lợi ích cho kỹ sư phần mềm. Một nhân viên Shopify so sánh \"tâm lý u ám với ChatGPT\" hiện giống những phát biểu tiêu cực về 5G, blockchain và Web3 trước kia. Những người khác tỏ ý hoài nghi khả năng các công ty đủ tiến bộ để áp dụng công nghệ AI một cách toàn diện.</p><p>\"Tất cả sẽ ổn thôi. Hãy coi AI là công cụ tăng năng suất, thay vì đối thủ. Chúng ta tạo ra nó, không phải ngược lại\", một kỹ sư tại Microsoft nói.</p>",
        "category": {
          "name": "Lập trình",
          "slug": "lap-trinh"
        },
        "hot": true,
        "status": 1,
        "author": {
          "id": "01971f20-6d78-49c0-bcef-a46aaa26b98b",
          "name": "Thienluc",
          "avatar": "/banner.png"
        },
        "description": "\"Công việc kỹ sư phần mềm đang chết dần. ChatGPT rất giỏi, và các bạn đang ở trong thế khó khăn\", một lập trình viên của Microsoft viết. Bài viết thu hút 500 phản hồi, trong đó một số cho rằng ngành lập trình vẫn vững vàng, nhưng không ít người nói \"mọi công việc của giới cổ cồn trắng đang chết dần\".",
        "createdAt": "6/5/2023"
      },
      {
        "id": "b056a40b-537f-4237-b814-3a2bbfcfd2f3",
        "title": "Năm lập trình viên bí ẩn phía sau Bitcoin",
        "slug": "nam-lap-trinh-vien-bi-an-phia-sau-bitcoin",
        "image": {
          "url": "https://i.ibb.co/StS9t81/bitcoin-9542-1628407826-7618-1676701945.jpg"
        },
        "content": "<p>Bitcoin Core, phần mềm kiểm soát sổ cái và xác thực khối hợp lệ của Bitcoin, được duy trì hoạt động bởi năm lập trình viên sống bằng tài trợ.</p><p>Andrew Chow bắt đầu tiếp xúc&nbsp;<a href=\"https://vnexpress.net/chu-de/bitcoin-3112\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(7, 109, 182);\">Bitcoin</a>&nbsp;từ khi còn là học sinh trung học. Anh xây dựng website với dòng chữ \"sẵn sàng làm việc để nhận Bitcoin\" kèm theo địa chỉ ví điện tử trước cả khi sở hữu tài khoản ngân hàng.</p><p>Bảy năm sau, Chow là một trong số ít lập trình viên được quyền chỉnh sửa phần mềm đứng sau loại tiền số có tổng giá trị 500 tỷ USD. Nhóm này đóng vai trò thiết yếu với sự sống còn của Bitcoin, nhưng gần như vô danh với hàng triệu người sở hữu loại tiền này.</p><p>Chow và bốn lập trình viên khác được gọi là \"người bảo dưỡng\", có trách nhiệm bảo đảm hoạt động của Bitcoin Core, phần mềm nguồn mở được thiết kế riêng nhằm xác định những khối hợp lệ chứa giao dịch Bitcoin được chấp thuận trên blockchain.</p><p>Dù mất hơn 2.000 tỷ USD giá trị so với giai đoạn cao điểm, Bitcoin vẫn là tiêu chuẩn vàng của giới tiền số. Đây là đồng tiền lâu đời và được nhiều người nắm giữ nhất, chiếm 40% tổng giá trị thị trường tiền điện tử trong nhiều năm.</p><p><img src=\"https://i1-sohoa.vnecdn.net/2023/02/18/bitcoin-1-JPG-9771-1629107508-2527-1676701945.jpg?w=680&amp;h=0&amp;q=100&amp;dpr=1&amp;fit=crop&amp;s=B0Brf7KPsxJk7K7kjj3TZQ\" alt=\"Giao diện ví trên nền tảng Bitcoin Core hồi năm 2012. Ảnh: Bitcoin.com\"></p><p>Giao diện ví trên nền tảng Bitcoin Core hồi năm 2012. Ảnh:&nbsp;<em>Bitcoin.com</em></p><p>Nhóm bảo dưỡng được coi là những người kế nhiệm&nbsp;<a href=\"https://vnexpress.net/so-hoa/tai-sao-cha-de-bitcoin-khong-lo-dien-4397085.html\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(7, 109, 182);\">Satoshi Nakamoto</a>, người sáng lập Bitcoin. Họ phải bảo đảm Bitcoin Core, ban đầu mang tên Bitcoin Qt, tương thích với những hệ điều hành mới nhất và ghi nhận đầy đủ mọi giao dịch trên hệ thống.</p><p>\"Phần mềm cần chăm sóc cẩn trọng hơn nhiều người nghĩ. Chúng ngày càng kém hiệu quả và dễ bị tấn công. Mọi công nghệ phải có người bảo dưỡng và giám sát. Bitcoin Core không phải ngoại lệ\", Jameson Lopp, chuyên gia từng viết mã lập trình cho dự án này, cho hay.</p><p>Với doanh nghiệp công nghệ bình thường, lập trình viên được tổ chức theo cấu trúc có sẵn, kèm theo người quản lý, mô tả công việc, đánh giá hiệu quả thường kỳ. Các công ty đại chúng sẽ cung cấp báo cáo tài chính, hoạt động và quản lý cho nhà đầu tư.</p><p>Trong khi đó, báo cáo của mạng lưới tiền số không được công bố theo cách thông thường, mà thông qua sách trắng, diễn đàn Internet cùng nền tảng quản lý dự án và phiên bản code Github. Nhóm bảo dưỡng Bitcoin Core và các lập trình viên thảo luận về những thay đổi ưu tiên, cũng như vấn đề nhân sự trong phòng chat công khai hàng tuần.</p><p>Bitcoin Core là phần mềm nguồn mở, cho phép mọi thành viên trên Github đề xuất thay đổi với mã lập trình. Tuy nhiên, chỉ người bảo dưỡng như Chow mới có quyền phê duyệt và đưa chúng vào kho chứa mã lập trình trên Github. Những điều chỉnh này sẽ có hiệu lực khi người dùng tải bản cập nhật Bitcoin Core được tung ra trung bình 6 tháng một lần.</p><p>\"Công việc đó có thể đáng sợ, nhưng dần trở nên dễ dàng, nhất là khi bạn biết cái gì không nên đụng vào\", Chow nói khi đề cập đến việc thay đổi mã nguồn Bitcoin Core.</p><p>Trong 18 tháng qua, đã có bốn người bảo dưỡng nghỉ việc với lý do kiệt sức hoặc lo ngại nguy cơ pháp lý. Các nhân sự mới được chọn qua những cuộc bỏ phiếu bất thường sau vòng thảo luận trong phòng chat. Các lập trình viên sẽ gõ \"ACK\" để đồng ý hoặc \"NACK\" để phản đối.</p><p>Cơ sở dữ liệu 450 GB của blockchain Bitcoin được lưu trữ trên mạng lưới gồm hàng chục nghìn máy tính, 99% trong số này sử dụng Bitcoin Core để ghi nhận giao dịch mới.</p><p>Một số lập trình viên cho rằng sự phổ biến của Bitcoin Core không phù hợp với mục tiêu của tiền điện tử, trong đó yêu cầu duy trì tính phi tập trung và không bị kiểm soát bởi chính phủ, tổ chức nào. Có nhiều phần mềm vận hành nút mạng Bitcoin, nhưng thiếu tính bảo mật và hàng loạt chức năng của Bitcoin Core.</p><p>Mạng lưới Bitcoin trả công cho thợ đào đóng góp năng lực xử lý để xác thực giao dịch, nhưng không có cơ chế nào nhằm hỗ trợ tài chính cho những lập trình viên duy trì hoạt động của phần mềm. Thay vào đó, nhà đầu tư và công ty tiền số hỗ trợ nhóm bảo dưỡng cùng những lập trình viên then chốt thông qua cơ chế trợ cấp.</p><p>Mô hình này đặt ra nghi vấn về khả năng xung đột lợi ích. \"Vấn đề được nhắc đến nhiều, bao gồm nguồn vốn trợ cấp và liệu có nguy cơ mạng lưới bị kiểm soát một cách bí mật hay không\", Samuel Dobson, từng làm việc bảo dưỡng cho Bitcoin Core, cho hay.</p><p>Một số nhà tài trợ cho biết khoản trợ cấp cho mỗi người bảo dưỡng nằm trong khoảng 100.000-150.000 USD mỗi năm. Trong khi đó, kỹ sư bậc trung ở Google có thể nhận lương 225.000 USD/năm, chưa kể trợ cấp, thưởng và chia cổ phiếu.</p><p>Trong tài liệu nộp lên Ủy ban Chứng khoán Mỹ (SEC), sàn giao dịch Coinbase nói mô hình tổ chức Bitcoin Core hiện có thể hạn chế năng lực tăng trưởng của mạng lưới, trong đó các thay đổi với mã nguồn sẽ tác động đến tốc độ, an ninh, khả năng sử dụng và giá trị của hệ thống.</p><p>Dobson cho biết các nhà phát triển Bitcoin Core được kiểm soát bởi chính uy tín của họ. Người đưa ra những thay đổi nguy hiểm hoặc thiếu đạo đức sẽ bị các lập trình viên khác tước quyền truy cập mã nguồn.</p><p><img src=\"https://i1-sohoa.vnecdn.net/2023/02/18/bitcoin-9542-1628407826-7618-1676701945.jpg?w=680&amp;h=0&amp;q=100&amp;dpr=1&amp;fit=crop&amp;s=J2Zs-dhJSQGQ61eWh1t93A\" alt=\"Đồng tiền mô phỏng Bitcoin. Ảnh: Reuters\"></p><p>Đồng tiền mô phỏng Bitcoin. Ảnh:&nbsp;<em>Reuters</em></p><p>Nhóm bảo dưỡng phân tán khắp thế giới, chỉ gặp nhau khoảng 1-2 lần mỗi năm tại các hội thảo về Bitcoin. Phần lớn sống ẩn dật, tránh để lộ thân phận.</p><p>Chow là cử nhân Đại học Maryland, giám sát các đoạn mã liên quan đến ví điện tử. Anh trở thành nhân viên của công ty hạ tầng tài chính Blockstream kể từ khi tốt nghiệp.</p><p>Một người khác là Marco Falke tập trung vào thử nghiệm, được tài trợ bởi sàn giao dịch Okcoin USA và công ty đầu tư Paradigm Operations LP. Falke cho biết anh lớn lên ở Đức và đã đi khắp châu Âu từ khi bỏ việc ở Mỹ năm 2020. Địa chỉ trong tài khoản Twitter của Falke nằm ở thành phố Malmo, miền nam Thụy Điển.</p><p>Wladimir van der Laan, thành viên lâu năm nhất trong nhóm, trở thành trưởng nhóm bảo dưỡng từ 2014, nhưng đã tìm cách rời bỏ vị trí này suốt hai năm qua. Hồ sơ của van der Laan cho thấy anh có vẻ đang làm việc tại Amsterdam.</p><p>Quá trình sửa lỗi trong Bitcoin Core tương đối tinh vi. Để loại bỏ lỗ hổng, phần lớn nút mạng Bitcoin phải chủ động cập nhật phần mềm. Nếu có nhiều thông tin lọt ra ngoài trước khi điều này diễn ra, những kẻ tấn công có khả năng lợi dụng.</p><p>\"Từng có nhiều đợt sửa chữa bí mật. Chúng tôi liên tục phát hiện lỗi trong các lần đánh giá mã nguồn. Chúng có thể hủy hoại toàn bộ mạng lưới nếu bị bỏ sót\", Chow cho hay.</p><p>Sự việc nghiêm trọng nhất từng được công bố diễn ra ngày 17/9/2018. Lập trình viên kỳ cựu Matt Corallo phát hiện lỗi trong Bitcoin Core giúp kẻ xấu tiêu một đồng Bitcoin nhiều lần. Nếu lỗ hổng bị lợi dụng, Bitcoin sẽ đánh mất yếu tố đột phá then chốt là sự khan hiếm và không thể bị sao chép - thứ khiến nó có giá trị cao trong mắt nhà đầu tư.</p><p>Corallo gửi tin nhắn mã hóa qua nền tảng Signal cho lãnh đạo một liên minh thợ đào Bitcoin, nhưng mô tả là \"sự cố từ chối dịch vụ\" nhằm giảm mức độ nghiêm trọng. Nhóm bảo đưỡng sau đó điều chỉnh Bitcoin Core và hối thúc người dùng cập nhật phần mềm. Chỉ khi đủ số lượng nút mạng cập nhật, nhóm mới công bố thông tin về sự việc.</p><p>Chow cho biết chỉ có 17 người có quyền thay đổi mã nguồn Bitcoin Core kể từ khi Satoshi Nakamoto phát hành hồi năm 2009. Dù được vận hành loại tiền số lớn nhất thế giới, những người bảo dưỡng thường nói với nhau rằng không ai thực sự muốn làm việc này. Như khi lập trình viên Samuel Dobson nghỉ việc hồi tháng 12/2021 để tập trung lấy bằng tiến sĩ, Falke tuyên bố người tiếp theo lên tiếng trong phòng chat sẽ thay thế vị trí của Dobson.</p><p>\"Tôi sẽ tìm ai để xử lý chuyện ghép ví đây?\", Chow hỏi, và Falke chúc mừng anh đã nhận công việc mới.</p><p>\"Thật à\", Chow đáp.</p><p><br></p>",
        "category": {
          "name": "Lập trình",
          "slug": "lap-trinh"
        },
        "hot": false,
        "status": 1,
        "author": {
          "id": "643a378d-29c1-484a-918f-caeaa41dfc83",
          "name": "Thienluc",
          "avatar": "/banner.png"
        },
        "description": "Chow cho biết chỉ có 17 người có quyền thay đổi mã nguồn Bitcoin Core kể từ khi Satoshi Nakamoto phát hành hồi năm 2009. Dù được vận hành loại tiền số lớn nhất thế giới, những người bảo dưỡng thường nói với nhau rằng không ai thực sự muốn làm việc này. Như khi lập trình viên Samuel Dobson nghỉ việc hồi tháng 12/2021 để tập trung lấy bằng tiến sĩ, Falke tuyên bố người tiếp theo lên tiếng trong phòng chat sẽ thay thế vị trí của Dobson.",
        "createdAt": "6/5/2023"
      },
      {
        "id": "b23831fd-b173-4bf0-9ae4-d59db9cdd5b1",
        "title": "Đề xuất trích 30% tiền đấu giá biển số ôtô để đảm bảo an toàn giao thông",
        "slug": "dje-xuat-trich-30percent-tien-djau-gia-bien-so-oto-dje-djam-bao-an-toan-giao-thong",
        "image": {
          "url": "https://i.ibb.co/P9K9wVT/o-to-9525-1683349041.jpg"
        },
        "content": "<p>Bộ Công an đề xuất sử dụng 30% số tiền thu được qua đấu giá biển số ôtô để đầu tư cơ sở vật chất, tập huấn cán bộ, phục vụ công tác đảm bảo an toàn giao thông.</p><p>Bộ Công an vừa hoàn thiện dự thảo nghị định về trình tự, thủ tục, nội dung liên quan thí điểm đấu giá biển số xe ôtô và chuyển đến Bộ Tư pháp thẩm định.</p><p>Theo dự thảo, số tiền đấu giá thu được nộp toàn bộ vào ngân sách trung ương. Bộ Công an mở một tài khoản để thu tiền trúng đấu giả. Tiền lãi phát sinh (nếu có) trên số dư tài khoản nộp toàn bộ vào ngân sách nhà nước.</p><p>Căn cứ vào nhu cầu kinh phí, Bộ Công an xây dựng dự toán tương ứng với 30% số tiền thu được từ đấu giá biển số xe năm trước đã nộp ngân sách nhà nước để phục vụ công tác đảm bảo trật tự an toàn giao thông.</p><p>Theo Bộ Công an, số tiền này nhằm đầu tư cơ sở vật chất, tập huấn nâng cao trình độ cho cán bộ làm đăng ký, quản lý phương tiện giao thông cơ giới đường bộ; đấu tranh phòng chống tội phạm và đảm bảo an ninh trật tự.</p><p>Tiền thu được từ đấu giá biển số ôtô từng gây ý kiến trái chiều tại kỳ họp Quốc hội tháng 11/2022. Một số đại biểu đề nghị thực hiện theo Luật Ngân sách nhà nước sau khi trừ chi phí thực hiện đấu giá. Trong khi đó, một số đại biểu đề nghị quy định ngay trong dự thảo Nghị quyết tỷ lệ phân bổ cho ngân sách trung ương và ngân sách địa phương, tỷ lệ gợi ý là 70-30, 60-40 và 50-50.</p><p><img src=\"https://i1-vnexpress.vnecdn.net/2023/05/06/o-to-9525-1683349041.jpg?w=680&amp;h=0&amp;q=100&amp;dpr=1&amp;fit=crop&amp;s=Lya4KrpGld9gYCt1jfwUnw\" alt=\"Ôtô Mercedes bốc được biển số có đuôi 28 được quan niệm là số đẹp. Ảnh: Thành Nhạn\"></p><p>Ôtô Mercedes bốc được biển số có đuôi 28 được quan niệm là số đẹp. Ảnh:&nbsp;<em>Thành Nhạn</em></p><p>Theo dự thảo, Bộ trưởng Công an sẽ phê duyệt kế hoạch tổ chức cho từng phiên đấu giá, gồm danh sách biển số, giá khởi điểm, bước giá, tiền đặt trước, hình thức, phương thức tổ chức đấu giá. Kế hoạch phải công khai trên cổng thông tin điện tử Bộ Công an trong 5 ngày từ khi phê duyệt.</p><p>Bộ trưởng Công an cũng quyết định số lượng biển số ôtô đưa ra đấu giá tại mỗi phiên. Trường hợp chưa đến kỳ đấu giá tiếp theo mà công an các tỉnh, thành phố đã hết biển số để đăng ký thì Bộ Công an giao Cục trưởng Cảnh sát giao thông quyết định.</p><p>Khi đã có danh sách biển số để đấu giá, Bộ Công an sẽ công khai trên cổng thông tin điện tử Bộ, trang thông tin Cục Cảnh sát giao thông. Danh sách này cũng được chuyển tới tổ chức đấu giá để niêm yết trong 30 ngày.</p><p>Người tham gia đấu giá được cấp tài khoản truy cập, hướng dẫn cách sử dụng, trả giá trên trang thông tin đấu giá trực tuyến. Họ được lựa chọn trong danh sách biển đưa ra đấu giá của tất cả địa phương trên cả nước.</p><p>Biển số đấu giá dự kiến bao gồm biển số ôtô của tỉnh, thành phố, ký hiệu series A, B, C, D, E, F, G, H, K, L, M, N, P, S, T, U, V, X, Y, Z có nền màu trắng, chữ và số màu đen, chưa đăng ký; dự kiến cấp mới; đang trong hệ thống đăng ký, quản lý xe của Bộ Công an.</p><p>Người tham gia phải nộp khoản tiền đặt trước vào tài khoản thanh toán riêng của tổ chức đấu giá mở tại ngân hàng, tối thiểu 3 ngày trước khi phiên đấu giá diễn ra. Số tiền đặt trước cụ thể quy định theo Luật Đấu giá tài sản 2016. Trong 15 ngày kể từ ngày có thông báo kết quả đấu giá, người trúng phải nộp toàn bộ tiền trúng đấu giá.</p><p>Hết thời hạn 12 tháng kể từ ngày cấp văn bản xác nhận biển số trúng đấu giá mà người trúng chưa đăng ký xe để gắn biển, phát sinh sự kiện bất khả kháng thì phải gửi đề nghị gia hạn bằng văn bản điện tử cho Bộ Công an qua hệ thống quản lý đấu giá. Trong trường hợp sự kiện bất khả kháng hay trở ngại khách quan, người trúng đấu giá chết nhưng biển số trúng đấu giá chưa đăng ký, người thừa kế được hoàn trả số tiền trúng đấu giá đã nộp.</p><p>Việc đấu giá biển số xe đẹp được Cục Cảnh sát giao thông đề xuất từ năm 1993, tuy nhiên gặp bế tắc vì Luật Đấu giá tài sản không đưa biển số xe vào danh mục tài sản đấu giá, các bộ liên quan không có căn cứ pháp lý triển khai. Tháng 12/2019, Văn phòng Chính phủ đã làm việc với Bộ Công an và thống nhất đẩy nhanh tiến độ, đưa việc đấu giá lên Cổng dịch vụ công quốc gia (dichvucong.gov.vn).</p><p>Tại kỳ họp thứ 4, Quốc hội đã thông qua Nghị quyết về thí điểm cấp quyền lựa chọn, sử dụng biển số ôtô thông qua đấu giá. Dự kiến việc thí điểm đấu giá biển số xe bắt đầu thực hiện từ 1/7 và kéo dài trong 3 năm.</p>",
        "category": {
          "name": "Tin tức",
          "slug": "tin-tuc"
        },
        "hot": false,
        "status": 1,
        "author": {
          "id": "2d8f3672-150b-4ebe-8d27-b533c1ce95fa",
          "name": "Thienluc",
          "avatar": "/banner.png"
        },
        "description": "Tại kỳ họp thứ 4, Quốc hội đã thông qua Nghị quyết về thí điểm cấp quyền lựa chọn, sử dụng biển số ôtô thông qua đấu giá. Dự kiến việc thí điểm đấu giá biển số xe bắt đầu thực hiện từ 1/7 và kéo dài trong 3 năm.",
        "createdAt": "6/5/2023"
      },
      {
        "id": "35496ef1-60a5-4b32-8d2d-f41982e897b8",
        "title": "Ancelotti muốn cùng Real hoàn tất bộ sưu tập danh hiệu",
        "slug": "ancelotti-muon-cung-real-hoan-tat-bo-suu-tap-danh-hieu",
        "image": {
          "url": "https://i.ibb.co/zsnd2gv/av25804-20230505074741-jpeg-16-7282-7856-1683343779.jpg"
        },
        "content": "<p>Mùa 2021-2022, sau khi trở lại Real từ Everton, Ancelotti giúp Real đoạt ba danh hiệu. Đội bóng hoàng gia dẫn đầu La Liga với khoảng cách 13 điểm, hạ Bilbao 2-0 ở chung kết Siêu Cup Tây Ban Nha và Liverpool 1-0 ở chung kết Champions League. Sang mùa này, họ còn thắng Frankfurt 2-0 để đoạt Siêu Cup châu Âu rồi đánh bại Saudi Al Hilal 5-3 trong trận chung kết FIFA Club World Cup. Tuy nhiên, Real sớm dừng bước ở Cup Nhà Vua mùa trước khi thua Bilbao 0-2 ở tứ kết.</p><p>Vì thế, Ancelotti quyết tâm hạ Osasuna khi vào chung kết Cup Nhà Vua mùa này để hoàn tất bộ sưu tập danh hiệu trong nhiệm kỳ thứ hai tại sân Bernabeu. \"Ngày mai, chúng tôi có thể đoạt mọi danh hiệu trong hai mùa nếu chiến thắng\", ông nói ngày 5/5 tại họp báo trước trận. \"Góp mặt ở chung kết luôn thú vị, cá nhân tôi luôn nghĩ mỗi trận chung kết có thể là trận cuối cùng của tôi. Tôi nghĩ như vậy vào năm 2003 và vẫn nghĩ như vậy hôm nay. Vì vậy, tôi muốn tận hưởng khoảnh khắc này\".</p><p><img src=\"https://i1-thethao.vnecdn.net/2023/05/06/av25804-20230505074741-jpeg-16-7282-7856-1683343779.jpg?w=680&amp;h=0&amp;q=100&amp;dpr=1&amp;fit=crop&amp;s=eymcMRIHARtZMCG9U1FD0w\" alt=\"HLV Ancelotti trong cuộc họp báo trước trận chung kết Cup Nhà Vua 2023. Ảnh: realmadrid.com\"></p><p>HLV Ancelotti trong cuộc họp báo trước trận chung kết Cup Nhà Vua 2023. Ảnh:&nbsp;<em>realmadrid.com</em></p><p>Trong nhiệm kỳ đầu dẫn dắt Real giai đoạn 2013-2015, Ancelotti đã giành Cup Nhà Vua khi đánh bại Barca 2-1 ở chung kết năm 2014. Ngoài ra, HLV Italy còn đoạt Champions League, Siêu Cup châu Âu và FIFA Club World Cup.</p><p><a href=\"https://vnexpress.net/chu-de/carlo-ancelotti-184\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(7, 109, 182);\">Ancelotti</a>&nbsp;khẳng định sẽ sử dụng đội hình mạnh nhất và cùng học trò ăn mừng chức vô địch nếu chiến thắng, dù phía trước là đại chiến Man City ở bán kết lượt đi Champions League ngày 9/5. \"Tại sao chúng tôi không ăn mừng?\", ông bày tỏ. \"Nếu thắng, bạn phải ăn mừng. Chúng tôi muốn chia sẻ niềm vui với người hâm mộ, những người đang chờ đợi để ăn mừng. Như Napoli đang mừng danh hiệu Serie A sau 33 năm, thật ngoạn mục. Tôi hy vọng Real có thể làm điều đó tối mai\".</p><p>HLV 63 tuổi cũng đề cao tầm quan trọng của việc nghỉ ngơi khi Real chuẩn bị bước vào hai tuần quyết định, với chung kết Cup Nhà Vua và hai lượt bán kết Champions League. Tại La Liga, họ sẽ chính thức trở thành cựu vương nếu Barca hạ Espanyol ở vòng tiếp theo ngày 14/5.</p><p>\"Tôi nghĩ khía cạnh tinh thần là rất quan trọng\", Ancelotti phân tích. \"Ba ngày với bóng đá không phải là nhiều, đặc biệt đội không được thi đấu trên sân nhà và phải di chuyển. Đó là lý do toàn đội sẽ ở lại đây vào tối mai. Nhưng các cầu thủ không cần thúc ép về mặt tinh thần và động lực, bởi họ nóng lòng đá trận chung kết này từ lâu rồi\".</p><p>Vào giữa tuần, chủ tịch LĐBĐ Brazil (CBF) Ednaldo Rodrigues xác nhận muốn bổ nhiệm Ancelotti dẫn dắt đội tuyển, nhưng chưa đưa ra đề nghị chính thức nào. Khi được hỏi về thông tin này, HLV Italy nhấn mạnh ông còn hợp đồng với Real đến hè 2024 và tương lai của ông không phụ thuộc vào kết quả chung kết Cup Nhà Vua hay bán kết Champions League.</p><p>HLV trưởng Real đánh giá Osasuna là đối thủ khó chơi. Ông đồng thời tiết lộ tiền vệ Luka Modric cùng hậu vệ David Alaba trở lại tập luyện đầy đủ và sẵn sàng xung trận trên sân La Cartuja de Sevilla hôm nay.</p>",
        "category": {
          "name": "Bóng đá",
          "slug": "bong-da"
        },
        "hot": false,
        "status": 1,
        "author": {
          "id": "12eee050-f208-4444-830a-973837d38435",
          "name": "Thienluc",
          "avatar": "/banner.png"
        },
        "description": "Vào giữa tuần, chủ tịch LĐBĐ Brazil (CBF) Ednaldo Rodrigues xác nhận muốn bổ nhiệm Ancelotti dẫn dắt đội tuyển, nhưng chưa đưa ra đề nghị chính thức nào. Khi được hỏi về thông tin này, HLV Italy nhấn mạnh ông còn hợp đồng với Real đến hè 2024 và tương lai của ông không phụ thuộc vào kết quả chung kết Cup Nhà Vua hay bán kết Champions League.",
        "createdAt": "6/5/2023"
      }
    ]
  ]
}
